In [1]:
import pandas as pd
import numpy as np

### creating series from scratch

In [2]:
my_list = [2,3,4, 'lk', 9.8]
rand = pd.Series(data = my_list, name = 'Age')
display(rand, my_list[3])

0      2
1      3
2      4
3     lk
4    9.8
Name: Age, dtype: object

'lk'

In [4]:
ages = pd.Series([12,13,14,19], name = 'Age', index = ['first', 'second', 'third', 'forth']);ages
# ages.max()

first     12
second    13
third     14
forth     19
Name: Age, dtype: int64

### Each column in a DataFrame is a Series
### A pandas Series has no column labels, as it is just a single column of a DataFrame. A Series does have row labels.

In [ ]:
labels = ['first', 'second', 'third', 'fourth', 'fifth']
pd.Series(data = my_list, index = labels)

In [5]:
# numpy Arrays

# arr = np.array([1,2,3,4,5])
# pd.Series(arr,labels)

ar = np.arange(5)
pd.Series(ar)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [7]:
df_student = pd.DataFrame({'Age': [10,19,24], 'Marks': [80,54,66]})
print(df_student)
df_student[['Age', 'Marks']].max()

   Age  Marks
0   10     80
1   19     54
2   24     66

Age      24
Marks    80
dtype: int64

## Describe

In [8]:
# The describe() method provides a quick overview of the numerical data in a DataFrame. 
# As the Name and Sex columns are textual data, these are by default not taken into account by the describe() method.

df_student.describe()

             Age      Marks
count   3.000000   3.000000
mean   17.666667  66.666667
std     7.094599  13.012814
min    10.000000  54.000000
25%    14.500000  60.000000
50%    19.000000  66.000000
75%    21.500000  73.000000
max    24.000000  80.000000

In [9]:
dict1 = {'1':'k','2':'o','3':'m','4':'a','5':'l'}
pd.Series(dict1)

1    k
2    o
3    m
4    a
5    l
dtype: object

In [ ]:
# From Scalar values
# single value
pd.Series(5.4, index = [101,102,103])

In [10]:
# data in series
# pd series can hold variety of object types
pd.Series(data = labels)

NameError: name 'labels' is not defined

In [ ]:
# Using an index

dict1['2']

In [12]:
ser1 = pd.Series([1,2,3],
                 index = ['a', 'b','c'])    

ser2 = pd.Series(np.array([10,20,30]),
                index = ['a', 'b','c'])

ser3 = pd.Series({'one':1,
                 'two' :2,
                 'three':3})
ser4 = pd.Series({'oe':1,
                 'to' :2,
                 'ree':3})


# display(ser3['two'],
#         ser2['b'],
#         ser1['b'])

# dict2 = {'ser1': ser1,
#          'ser2':ser2,
#          'ser3':ser3}
# dict2
# pd.DataFrame(dict2)    #or
df1 = pd.DataFrame({'series1': ser1,
             'series2':ser2,
             'series3':ser3,
            'series4': ser4})
df1
# display(df1[['series2','series3', 'series4']])

       series1  series2  series3  series4
a          1.0     10.0      NaN      NaN
b          2.0     20.0      NaN      NaN
c          3.0     30.0      NaN      NaN
oe         NaN      NaN      NaN      1.0
one        NaN      NaN      1.0      NaN
ree        NaN      NaN      NaN      3.0
three      NaN      NaN      3.0      NaN
to         NaN      NaN      NaN      2.0
two        NaN      NaN      2.0      NaN

In [13]:
lis1 = [1,2,3]
lis2 = [9,'9',9.9]
lis3  = ['k',8,'a']
pd.DataFrame({'list1':lis1,
            'list2':lis2,
            'list3':lis3})

   list1 list2 list3
0      1     9     k
1      2     9     8
2      3   9.9     a

In [14]:
pd.DataFrame({'list1':[10,20,30,40],
            'list2' :[50,60,70,80],
            'list3' :[90,100,110,120]})

   list1  list2  list3
0     10     50     90
1     20     60    100
2     30     70    110
3     40     80    120

## Numpy implementation into Pandas

In [15]:
# use numpy
# pd.DataFrame({'arr1': np.arange(10,50,10),
#              'arr2': np.arange(50,90,10),
#              'arr3': np.arange(90,130,10)})

pd.DataFrame(np.arange(10,121,10).reshape(4,-1), columns = list('ABC'))

# colname always in list else error

     A    B    C
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [17]:
# display(ser1, ser2, ser3)

df = pd.DataFrame(
            {'ser1':ser1,
             'ser2':ser2,
             'ser3':ser3}
            )

# col selection

# display(df[['ser2', 'ser3']])   #multiple cols
# df.ser2 # fetches 1col

In [ ]:
df.head()

In [ ]:
df.tail(2)

In [18]:
df.ser1.values
# gives values irrespective of colnames

df.values
# can make changes and then make it DF again

df.columns
# get columns
[i+'_1' for i in df.columns]

['ser1_1', 'ser2_1', 'ser3_1']

In [26]:
df = pd.DataFrame(np.arange(20, 0 ,-1).reshape(5,-1), columns = list('ABCD'), index = list('ABCDE'))
df

    A   B   C   D
A  20  19  18  17
B  16  15  14  13
C  12  11  10   9
D   8   7   6   5
E   4   3   2   1

### syntax -
###    df.replace(to_replace=None,value=None,inplace=False,method='pad')

###       - to_replace = str, regex, list, dict, Series, int, float, or None
###       - value  = scalar, dict, list, str, regex, default None
###       - method : {‘pad’, ‘ffill’, ‘bfill’, None}

In [20]:
df

    A   B   C   D
A  20  19  18  17
B  16  15  14  13
C  12  11  10   9
D   8   7   6   5
E   4   3   2   1

In [21]:
# replace values

df.replace(1, 'replaced') #, inplace = True
df

    A   B   C         D
A  20  19  18        17
B  16  15  14        13
C  12  11  10         9
D   8   7   6         5
E   4   3   2  replaced

In [22]:
# list to replace

df.replace([1,2,3], 'multiple_rep')

    A             B             C         D
A  20            19            18        17
B  16            15            14        13
C  12            11            10         9
D   8             7             6         5
E   4  multiple_rep  multiple_rep  replaced

In [ ]:
display(df, df.replace([1,2,3,4], [40,30,20,10]))

In [23]:
df.replace([1,2,7], ['one', 'two', 'seven'])

    A      B    C         D
A  20     19   18        17
B  16     15   14        13
C  12     11   10         9
D   8  seven    6         5
E   4      3  two  replaced

In [24]:
# backward_fill
display(df, df.replace([11,12,7], method = 'bfill'))

    A   B   C         D
A  20  19  18        17
B  16  15  14        13
C  12  11  10         9
D   8   7   6         5
E   4   3   2  replaced

    A   B   C         D
A  20  19  18        17
B  16  15  14        13
C   8   3  10         9
D   8   3   6         5
E   4   3   2  replaced

In [25]:
# forward_fill
# treatment for data replacement and NaN values
display(df, df.replace([11,12,7], method = 'ffill'))

    A   B   C         D
A  20  19  18        17
B  16  15  14        13
C  12  11  10         9
D   8   7   6         5
E   4   3   2  replaced

    A   B   C         D
A  20  19  18        17
B  16  15  14        13
C  16  15  10         9
D   8  15   6         5
E   4   3   2  replaced

In [27]:
# dict-like replace
df.replace({1:'one', 2:'Two', 7:'seven'})

    A      B    C    D
A  20     19   18   17
B  16     15   14   13
C  12     11   10    9
D   8  seven    6    5
E   4      3  Two  one

In [ ]:
df.replace({'A':[20,8,11], 'B':[15,3]}, 100)

# how to replace multiple random values

In [ ]:
df.replace({'A': {20:200, 4:400}, 'B':{15:1500}, 'C':{2:200}, 'D':{17:1700}})
# column-wise replacement

In [28]:
# replace NaN with value
# df.replace(1,np.nan)
df.replace([1,20,14],np.nan) .isnull().sum()  # isna()

A    1
B    0
C    1
D    1
dtype: int64

In [29]:
df
df.replace([1,20,14,3], np.nan).isna().astype(int)

   A  B  C  D
A  1  0  0  0
B  0  0  1  0
C  0  0  0  0
D  0  0  0  0
E  0  1  0  1

In [30]:
df.replace({'B':[15,11], 'C':[14,2]},np.nan).isna()[['B', 'C']].astype(int)

   B  C
A  0  0
B  1  1
C  1  0
D  0  0
E  0  1

In [ ]:
df[['B', 'C']].replace([20,1,2,4], np.nan).isna().astype(int)

In [ ]:
df2 = df.replace([20,12,3,9], np.nan).isna()
df2
df2[['B', 'C']] = df2[['B', 'C']].astype(int)
df2

In [ ]:
df.ndim

In [ ]:
df.values

In [ ]:
df.values.flatten().ndim

In [ ]:
df.values.flatten().reshape(4,-1)

In [ ]:
df.values>10

In [ ]:
# indexing and slicing

df['A']
df.A
df[['A', 'B']]

In [ ]:
type(df) #DF

In [ ]:
type(df['A'])  #Series

In [ ]:
type(df[['A','C']])  #DF

In [ ]:
# new column introduced

df['E'] = df['A'] / df['C']
df

In [ ]:
df['F'] = [1.1, 2.1, 3.1, 4.1,5.1]
df

In [ ]:
df['E'] = np.round(df['E'], 2)
df

In [ ]:
len(df)
# rows

In [ ]:
df.shape
df.shape[0]
# row and cols

In [ ]:
# removing cols and rows
# by default checks rows(0 = rows, 1 = cols)

df.drop('E' , axis = 1)  
# df.drop('E', 1)

In [ ]:
df.drop('E', axis = 0)

In [ ]:
df.rename(df'A': 'a'})

In [31]:
df = pd.DataFrame({'location' : ['new-york', 'atlanta', 'boston', 'alaska', 'toronto', 'delhi', 'london', 'texas', 'pacific', 'ontanio'],
                  'month' : [ 'apr', 'jan', 'feb', 'dec', 'jul', 'jun', 'mar', 'aug', 'dec', 'apr' ],
                  'sales' : [1221, 3232, 3423, 34342, 343, 4333, 4245, 4544, 4543, 56585]})
df

   location month  sales
0  new-york   apr   1221
1   atlanta   jan   3232
2    boston   feb   3423
3    alaska   dec  34342
4   toronto   jul    343
5     delhi   jun   4333
6    london   mar   4245
7     texas   aug   4544
8   pacific   dec   4543
9   ontanio   apr  56585

In [32]:
rename = df.rename(columns = {'location': 'lolo', 'month': 'mono'}) #index
rename

       lolo mono  sales
0  new-york  apr   1221
1   atlanta  jan   3232
2    boston  feb   3423
3    alaska  dec  34342
4   toronto  jul    343
5     delhi  jun   4333
6    london  mar   4245
7     texas  aug   4544
8   pacific  dec   4543
9   ontanio  apr  56585

In [36]:
df.rename_axis('lolo', axis = 'columns', inplace = True)

In [38]:
df.rename(axis = {'lolo':'lolita'})

TypeError: must pass an index to rename

In [43]:
reindex = df.rename_axis('koko', axis = 'columns')
reindex
# reindexed = reviews.rename_axis('wines', axis='rows')

koko  location month  sales
0     new-york   apr   1221
1      atlanta   jan   3232
2       boston   feb   3423
3       alaska   dec  34342
4      toronto   jul    343
5        delhi   jun   4333
6       london   mar   4245
7        texas   aug   4544
8      pacific   dec   4543
9      ontanio   apr  56585

## Creating new DataFrame

In [ ]:
arr1 = np.array(
    [
    ['New York','Mar',12714],
    ['Michigan','Apr',89238],
    ['Atlanta','Jan',8161],
    ['Boston','Sep',5885],
    ['Birmingham','Mar',10000],
    ['Clanton','Feb',1714],
    ['Marion','Dec',9238],
    ['Atlantis','Nov',58161],
    ['Alaska','Feb',585],
    ['Arozona','Mar',10000],
    ['Pacfic','Aug',2714],
    ['Ontario','June',189238],
    ['Toronto','Jan',81651],
    ['Delhi','Oct',58855],
    ['London','Apr',1080],
    ['Texas','Sep',1714],
    ['Washington','Jul',2038],
    ['Florida','Jan',8161],
    ['Michigan','Oct',58185],
    ['New_Jersy','Apr',10015],
    ['Michigan', 'Mar', 123112]
  ])

arr1

In [ ]:
df2 = pd.DataFrame(arr1,columns=['location','month','sales'])
df2

In [ ]:
arr = np.random.randint(1,100,21)
df2['sold_units'] = pd.DataFrame(arr, columns = ['sold_units'])

In [ ]:
df2.head(3)

In [ ]:
df2.drop(columns = ['no_of_units'], inplace = True)

In [ ]:
df2[['location', 'month']]

In [ ]:
df2.info()

In [ ]:
df2['sales'] = df2['sales'].astype(int)

In [ ]:
df2[(df2['sales']>5000) & (df2['sales']<10000)]

In [ ]:
df2.loc[df2['sales']>50000, ['location']]

In [ ]:
df2[(df2['sales']>5000) & (df2['month'] == 'Dec')]

In [ ]:
df2.info()

In [ ]:
df2.dtypes
# object is the data type of string

In [ ]:
df2.loc[df2['month'] == 'Dec', ['sales', 'location']]

In [ ]:
df2['city_month'] = df2['location'] +'_'+ df2['month']
df2
# df2['sales'] = df2['sales'].astype(str)
df2['city_sales'] = df2['location']+ '_'+ df2['sales'].astype(str)
df2

In [ ]:
df2.rename(columns = {'location': 'state'}, inplace = True)
df2.head()

In [ ]:
df2.replace({'state': {'Atlanta': 'Atlantaa'}})

In [ ]:
df.rename(str.lower, axis='columns')
df.rename({1: 2, 2: 4}, axis='index')

In [ ]:
df2.sort_values('sales', 
                inplace = True, 
               ascending = 0, 
               ignore_index = True)
df2.head()
# df2.reset_index(drop = True)
# df2['sales'] = df2['sales'].astype(int)
# df2.dtypes

In [ ]:
df2.min()

In [ ]:
max(df2['sales'])

In [ ]:
df2.drop(columns = ['city_month', 'city_sales'])

### String Operation CONTAINS

In [ ]:
df2[df2['location'].str.contains('Ont')]

In [ ]:
df2[df2['State'].str.contains('Bir')]

In [ ]:
df2[df2['month'].str.contains('Feb')]

In [ ]:
df2.rename(columns = {'State':'state'}, inplace = True)

In [ ]:
df2.head(2)

In [ ]:
df2[df2['month'].str.contains('Fe', 'A')].reset_index(drop = True)

In [ ]:
df2.set_index('state')

In [ ]:
df2.sales = df2.sales.astype(int)
df2['sales_2'] = df2.sales/12

In [ ]:
df2.drop(columns = 'sales_2', inplace = True)

In [ ]:
df2.drop(columns = ['sales', 'month'])

In [ ]:
df2.describe()

In [ ]:
df2.describe(include = 'all')

In [ ]:
df2.describe(include = ['object', 'int64'])
df2

In [ ]:
k = ['Michigan','Atlantis','Atlantis','Atlanta']
['ABC'if 'is' in name else name for name in k]

In [ ]:
df2['location'].apply(lambda x: 'ION' if 'ion' in x else x)

In [ ]:
df2.info()

In [ ]:
# practice one liner 
df2['sales'] = df2['sales'].astype(int)
# df2['grade1'] = df2['sales'].apply(lambda x: 'C' if x <=5000 else 'B'if x<10000 & x>5000 else 'A')
df2

df2['grade'] = ['C' if x <5000 else 'B'if x < 10000 and x>5000 else 'A' for x in df2.sales]
df2.head(21)
# df2.drop(columns = 'grade1')

In [ ]:
# diff b/w rename and replace in terms of functionality
#

In [ ]:
df2.rename(columns = {'location':'state'}, inplace = True)

df2.head()

In [ ]:
df2['state'].nunique   #count of uniques
df2['state'].unique # uniques

In [ ]:
df2[df2['location'] == 'Michigan ']
# why not getting all michigan values

In [ ]:
df2.max()

In [ ]:
df2.min()

In [ ]:
df = df2.set_index('state')

In [ ]:
df.loc['Atlanta']

In [ ]:
5+100/10

In [ ]:
df.sort_values('sales', inplace = True, ascending = 0)
df.head

In [ ]:
df.sort_values(by = ['sales', 'sold_units'])

In [ ]:
df.dtypes

In [ ]:
df.rename(index = {'Atlanta':'Atlantaaaaaaaaa'})

In [ ]:
indexvalues =min(df[df['sales']])
indexvalues
# df.drop(indexvalues, inplace = True)

In [ ]:
df.drop(index = {'state'})
# df

In [ ]:
df = df.drop(columns = 'sales').max()
df.head()

In [ ]:
df2['sales'] = df2.sales.astype(int)
df2[(df2['location'] == 'Alaska') & (df2['month'] == 'Feb') & (df2['sales'] == 585)]

In [ ]:
df2[df2['location'].str.contains('Alaska')][df2['month'].str.contains('Feb')]

In [ ]:
# df2['grade1'] = df2['sales'].apply(lambda x: 'C' if x <=5000 else 'B'if x<10000 & x>5000 else 'A')

df2['location1'] = df2.location.apply(lambda x: x.swapcase())
df2['month1'] = df2['month'].map(lambda x: x.swapcase())
df2.head(2)
df2['loc_month'] = df2['location1'] + '_' + df2['month1']
df2.head(2)

In [ ]:
df2.head(2)

In [ ]:
# concat in other ways

df2['loc_month'] = df2[['location1', 'month1']].apply(lambda x: '__'.join(x), axis = 1)
df2['loc_month'] = df2[['location', 'month']].apply(lambda x: x[0] + '_' + x[1], axis = 1)

In [ ]:
df2['new'] = df2[['location1', 'month1', 'sales']].apply(lambda x: x[0] +'__'+ x[1] +'__'+ str(x[2]), axis = 1)

In [ ]:
df2.head()

In [ ]:
df2.month.loc[0:6]
df2['month'].loc[0:6]

In [ ]:
df3 = df2.set_index('location')

In [ ]:
df3.loc['Boston', 'month1']   # row,cols

In [ ]:
df3.sales.loc[['Birmingham','New York', 'Boston']]

In [ ]:
df3.loc[['Birmingham','New York', 'Boston'], ['sales', 'month1', 'location1']]

In [ ]:
df3.loc[['Birmingham','New York', 'Boston']] # all cols with selected indexes

In [ ]:
df2.loc[4,'sales']
df2.sales.loc[4]

In [ ]:
df2.loc[4,['sales', 'month']]

In [ ]:
df2.loc[[1,3,5], ['sales', 'month']]

In [ ]:
df2.loc[2:8, ['sales']]

In [ ]:
df2 = df2.loc[1]

In [ ]:
df2

In [ ]:
df2.location.unique()

In [ ]:
df2[['location', 'sales', 'month']].apply(lambda x: x[0:3])

In [ ]:
# ILOC ---Index location 
# Index number given and not names like loc

In [ ]:
df2.iloc[1:4]   # searches for index strictly so '0' se start hoga

In [ ]:
df2.iloc[1:4, 1:2]

In [ ]:
df2.iloc[: ,2]    # out of bound --> index that doesn't exist

In [ ]:
df2.iloc[: , [1,0,2]]

In [ ]:
df2.iloc[:6, 1:]

In [ ]:
df2.sales.astype(int).sum()

In [ ]:
df2.location.unique()

In [ ]:
df2.month.unique()

In [ ]:
df2.sales.unique()

In [ ]:
[df2[i].unique() for i in df2.columns]

In [ ]:
df2.columns.unique()

In [ ]:
df2.location.nunique(dropna = False)

In [ ]:
[[i, df2[i].nunique()] for i in df2.columns]

In [ ]:
df2.head()

In [ ]:
# creating new columne grade

df2['grade'] = df2['sales'].astype(int).apply(lambda x: 'C' if x<=5000 else 'B' if x<=10000 and x>5000 else 'A')
# df2['grade1'] = df2['sales'].apply(lambda x: 'C' if x <=5000 else 'B'if x<10000 & x>5000 else 'A')

In [ ]:
df2.head(10)

In [ ]:
def remarks(grade):
    if grade == 'A':
        return 'good'
    elif grade == 'B':
        return 'fine'
    else:
        return 'poor'
df2['remarks'] = df2.apply(lambda x: remarks(x['grade']), axis = 1)
df2['remarks'] = df2['grade'].apply(lambda x: if )

# df['CustomRating'] = df.apply(lambda x: custom_rating(x['Genre'],x['Rating']),axis=1)
# df.apply(lambda x: func(x['col1'],x['col2']),axis=1)
# genre[thriller] -> rating+1
# genre[comedy] -> rating-1

In [ ]:
df2.head(10)

In [ ]:
# data filtering 

df2[df2['location'].isin(['Atlantis','Birmingham'])]

In [ ]:
df2[df2.isin({'location': ['Atlantis','Birmingham'], 'month': ['Feb', 'Dec']})]

In [ ]:
df2['ratings'] = [5 if i == 'A' else 3 if i == 'B' else 1 for i in df2.grade]

In [ ]:
df2.info()

In [ ]:
# create new columns of locations greater than 6
new_df = df2['location'].apply(lambda x:  if x>6, axis = 1)

In [ ]:
new_df

## Missing Data

In [ ]:
df = pd.DataFrame({'A':[10,3,np.nan],
                  'B':[9,np.nan,np.nan],
                  'C':[15,20,35],
                  'D':[np.nan,np.nan,np.nan],
                    'E':[12,np.nan,0]
                  })

#  np.nan gives a null value

In [ ]:
df

In [ ]:
df.dropna()  # all na value droped

In [ ]:
df.dropna(axis = 'columns')  # drop column with atleat one na value

In [ ]:
# drops by default row with NaN
df.dropna(how = 'any')  # drop na from rows

In [ ]:
df.dropna(how = 'all') # drop row with all NaN

In [ ]:
df.dropna(how = 'all', axis = 1) # drop

In [ ]:
df.dropna(how = 'any',axis = 1)

In [ ]:
df

In [ ]:
df.dropna(thresh = 2)

# thresh o/p given no. of non-null values

In [ ]:
df.dropna(axis = 1, thresh = 3)

In [ ]:
df.fillna(value = 'ANYTHING')

In [ ]:
df.fillna(method = 'ffill')

In [ ]:
df.fillna(method = 'bfill')

In [ ]:
df.fillna(method = 'ffill', axis = 1)

In [ ]:
values = {'A':0, 'B':1,'C':2, 'D':3, 'E':4}
df.fillna(value = values)

In [ ]:
df.fillna(axis = 1, method = 'ffill', limit = 2)

In [ ]:
df.info()

In [ ]:
dff = df.fillna('%.2f' %df['C'].mean())
'''
Python generates the error message you present in your question whenever you call the int() builtin function
with a string argument that cannot be parsed as an integer;
and, in fact, the error message shows you the precise string it was trying to parse as an integer: namely ‘0.25’.
'''

In [ ]:
df.fillna(np.round(df['C'].mean(), 2), inplace = True)
df

In [ ]:
df.fillna(df.C.mean()).round(2)

In [ ]:
df.astype(int)

In [ ]:
df.isna().sum()

In [ ]:
# df['A'].fillna(method = 'ffill')
df['A'].fillna(df['A'].mean())

# Duplicated Data
## DataFrame.duplicated(subset=None, keep='first')
## Return boolean Series denoting duplicate rows.

In [ ]:
['one'] * 3

In [ ]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 'k2': [1,1,2,3,3,4,4], 'k3': ['ye', 'lo', 'ye', 'leo', 'can', 'be', 'me']})

In [ ]:
data

In [ ]:
data.duplicated() # bool

In [ ]:
data.duplicated(subset = ['k3'])
# subset to a particular column

In [ ]:
# By setting keep on False, all duplicates are True.
data.duplicated(keep = False)

In [ ]:
data.duplicated().sum()

In [ ]:
data['k1'].duplicated().sum()

In [ ]:
data['k1'].unique() # unique values
# data['k1'].nunique() # number of unique values

In [ ]:
data.drop_duplicates()

In [ ]:
data['k1'].drop_duplicates()

In [ ]:
data.drop_duplicates(subset = ['k1', 'k2'], keep = 'last')
# drop duplicates on required columns

In [ ]:
Data = {'Product': ['AAA','BBB','CCC','DDD'],
          'Price': ['250','ABC260','270','280XYZ']}
df = pd.DataFrame(Data)
# pd.to_numeric(Data['Price'], errors = 'ignore') # raise, coerce
# df['Price'].astype(float)